fonecmid-diplom/src/DataProcessors/ВКМ_КалендарьСпециалистов/ВКМ_КалендарьСпециалистов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ВКМ_КалендарьСпециалистов</name>
</mdclass:DataProcessor>

fonecmid-diplom/src/Documents/ВКМ_ОбслуживаниеКлиента/ВКМ_ОбслуживаниеКлиента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ОбслуживаниеКлиента</name>
  <registerRecords>AccumulationRegister.ВКМ_ВыполненныеКлиентуРаботы</registerRecords>
  <registerRecords>AccumulationRegister.ВКМ_ВыполненныеСотрудникомРаботы</registerRecords>
  <attributes>
    <name>ВКМ_Клиент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_Специалист</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ДатаПроведенияРабот</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ВремяНачалаРабот</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ВремяОкончанияРабот</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ОписаниеПроблемы</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВКМ_ВыполненныеРаботы</name>
    <attributes>
      <name>ВКМ_ОписаниеРабот</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1000</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВКМ_ФактическиПотраченоЧасов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВКМ_ЧасыКОплатеКлиенту</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВКМ_Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/DataProcessors/ВКМ_КалендарьСпециалистов/Forms/Форма/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Планировщик
	
	// 1. Единица времени - Час 
	ДеревоПланировщика.ТекущиеПериодыОтображения.Очистить();
	ДеревоПланировщика.ТекущиеПериодыОтображения.Добавить(НачалоДня(ТекущаяДата()), КонецДня(ТекущаяДата())); // Показываем сегодня
	ДеревоПланировщика.ШкалаВремени.Единица = ТипЕдиницыШкалыВремени.Час;
	ДеревоПланировщика.ШкалаВремени.Кратность = 1; // Шаг 1 час
	
	// 2. Добавляем "Измерения" - это Специалисты 

	ДеревоПланировщика.Элементы.Очистить();
	
	ЗапросСотрудники = Новый Запрос;
	ЗапросСотрудники.Текст = "ВЫБРАТЬ Ссылка, Наименование ИЗ Справочник.Пользователи ГДЕ НЕ ПометкаУдаления";
	ВыборкаСотр = ЗапросСотрудники.Выполнить().Выбрать();
	
	Пока ВыборкаСотр.Следующий() Цикл
		НовыйСотрудник = ДеревоПланировщика.Элементы.Добавить(ВыборкаСотр.Ссылка); // Ключ - ссылка
		НовыйСотрудник.Текст = ВыборкаСотр.Наименование;
	КонецЦикла;
	
	// 3. Загружаем данные из документов
	ЗаполнитьПланировщикНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПланировщикНаСервере()
	
	ДеревоПланировщика.Элементы.Очистить(); 
	
	ЗапросСотрудники = Новый Запрос;
	ЗапросСотрудники.Текст = "ВЫБРАТЬ Ссылка, Наименование ИЗ Справочник.Пользователи ГДЕ НЕ ПометкаУдаления";
	ВыборкаСотр = ЗапросСотрудники.Выполнить().Выбрать();
	
	Пока ВыборкаСотр.Следующий() Цикл
		НовыйСотрудник = ДеревоПланировщика.Элементы.Добавить(ВыборкаСотр.Ссылка);
		НовыйСотрудник.Текст = ВыборкаСотр.Наименование;
	КонецЦикла;

	// получаем документы
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Обслуживание.Ссылка КАК Ссылка,
		|	Обслуживание.ВКМ_ДатаПроведенияРабот КАК Дата,
		|	Обслуживание.ВКМ_ВремяНачалаРабот КАК Начало,
		|	Обслуживание.ВКМ_ВремяОкончанияРабот КАК Окончание,
		|	Обслуживание.ВКМ_ОписаниеПроблемы КАК Описание,
		|	Обслуживание.ВКМ_Специалист КАК Специалист
		|ИЗ
		|	Документ.ВКМ_ОбслуживаниеКлиента КАК Обслуживание
		|ГДЕ
		|	НЕ Обслуживание.ПометкаУдаления"; // Можно добавить отбор по периоду
		
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ЭлементРасписания = ДеревоПланировщика.Элементы.Найти(Выборка.Специалист);
		
		Если ЭлементРасписания <> Неопределено Тогда
			
			Запись = ДеревоПланировщика.Элементы.Добавить(Выборка.Ссылка); // Ключ записи - ссылка на документ
			Запись.Начало = СоединитьДатуИВремя(Выборка.Дата, Выборка.Начало);
			Запись.Конец = СоединитьДатуИВремя(Выборка.Дата, Выборка.Окончание);
			Запись.Текст = Выборка.Описание;
			Запись.ЗначенияИзмерений = Новый Соответствие;
			Запись.ЗначенияИзмерений.Вставить(ДеревоПланировщика.Измерения.Получить(0), Выборка.Специалист);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция СоединитьДатуИВремя(ДатаДаты, ДатаВремени)

	Возврат НачалоДня(ДатаДаты) + (ДатаВремени - НачалоДня(ДатаВремени));
	
КонецФункции
